kuangyue111/kuangyue111/软件例程/S32K144_SDK_RTM_2_0_Iar_Gcc_CombinePrj/S32K144_SDK_RTM_2_0_Iar_Gcc_CombinePrj/SDK/platform/pal/timing/src/timing_pal.c
/*******************************************************************************
 * Private Functions
 ******************************************************************************/

#if (defined(TIMING_OVER_LPIT))
/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_InitLpit
 * Description   : This function initializes TIMING over LPIT.
 *END**************************************************************************/
static status_t TIMING_InitLpit(uint32_t instance,
                                const timer_config_t * config)
{
    DEV_ASSERT(instance < LPIT_INSTANCE_COUNT);

    status_t status = STATUS_SUCCESS;
    const IRQn_Type lpitIrq[LPIT_INSTANCE_COUNT][LPIT_TMR_COUNT] = {LPIT_IRQS};
    lpit_user_config_t lpitConfig;
    lpit_user_channel_config_t channelConfig;
    timer_chan_state_t * channelState;
    uint32_t chanIndex;
    uint8_t index;

    /* Set global structure */
    lpitConfig.enableRunInDebug = true;
    lpitConfig.enableRunInDoze = true;
    /* Set channel configuration structure */
    channelConfig.timerMode = LPIT_PERIODIC_COUNTER;
    channelConfig.periodUnits = LPIT_PERIOD_UNITS_COUNTS;
    channelConfig.period = 0U;
    channelConfig.triggerSource = LPIT_TRIGGER_SOURCE_EXTERNAL;
    channelConfig.triggerSelect = 0U;
    channelConfig.enableReloadOnTrigger = false;
    channelConfig.enableStopOnInterrupt = false;
    channelConfig.enableStartOnTrigger = false;
    channelConfig.chainChannel = false;
    channelConfig.isInterruptEnabled = true;
    /* Initialize LPIT instance */
    LPIT_DRV_Init(instance, &lpitConfig);
    /* Initialize LPIT channels */
    for (index = 0U; index < config->numChan; index++)
    {
        chanIndex = config->chanConfigArray[index].channel;
        channelState = &s_lpitState[instance][chanIndex];
        /* Initialize LPIT channels */
        status = LPIT_DRV_InitChannel(instance, chanIndex, &channelConfig);
        if (status != STATUS_SUCCESS)
        {
            break;
        }
        /* Save runtime state structure of timer channel */
        channelState->chanType = config->chanConfigArray[index].chanType;
        channelState->callback = config->chanConfigArray[index].callback;
        channelState->callbackParam = config->chanConfigArray[index].callbackParam;
        channelState->enableNotification = false;
        /* Enable LPIT interrupt */
        INT_SYS_EnableIRQ(lpitIrq[instance][chanIndex]);
    }

    return status;
}
#endif

#if (defined(TIMING_OVER_LPTMR))
/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_InitLptmr
 * Description   : This function initializes TIMING over LPTMR.
 *END**************************************************************************/
static status_t TIMING_InitLptmr(uint32_t instance,
                                 const timer_config_t * config)
{
    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);

    status_t status = STATUS_SUCCESS;
    const IRQn_Type lptmrIrq[LPTMR_INSTANCE_COUNT][LPTMR_TMR_COUNT]  = {LPTMR_IRQS};
    lptmr_config_t lptmrConfig;
    timer_chan_state_t * channelState;
    uint8_t chanIndex;
    uint8_t index;

    /* Set lptmr structure */
    lptmrConfig.dmaRequest = false;
    lptmrConfig.interruptEnable = true;
    lptmrConfig.freeRun = false;
    lptmrConfig.workMode = LPTMR_WORKMODE_TIMER;
    lptmrConfig.clockSelect = ((extension_lptmr_for_timer_t*)(config->extension))->clockSelect;
    lptmrConfig.prescaler = ((extension_lptmr_for_timer_t*)(config->extension))->prescaler;
    lptmrConfig.bypassPrescaler = ((extension_lptmr_for_timer_t*)(config->extension))->bypassPrescaler;
    lptmrConfig.counterUnits = LPTMR_COUNTER_UNITS_TICKS;
    lptmrConfig.pinSelect = LPTMR_PINSELECT_TRGMUX;
    lptmrConfig.pinPolarity = LPTMR_PINPOLARITY_RISING;
    lptmrConfig.compareValue = 0U;
    /* Save LPTMR clock source name */
    s_lptmrClockSource[instance] = ((extension_lptmr_for_timer_t*)(config->extension))->clockSelect;
    /* Save LPTMR prescaler */
    s_lptmrPrescaler[instance] = ((extension_lptmr_for_timer_t*)(config->extension))->prescaler;
    /* Save LPTMR bypass enable */
    s_lptmrBypassPrescaler[instance] = ((extension_lptmr_for_timer_t*)(config->extension))->bypassPrescaler;
    /* Initialize LPTMR instance */
    LPTMR_DRV_Init(instance, &lptmrConfig, false);

    for (index = 0U; index < config->numChan; index++)
    {
        chanIndex = config->chanConfigArray[index].channel;
        DEV_ASSERT(chanIndex < LPTMR_TMR_COUNT);
        channelState = &s_lptmrState[instance][chanIndex];
        /* Save runtime state structure of timer channel */
        channelState->chanType = config->chanConfigArray[index].chanType;
        channelState->callback = config->chanConfigArray[index].callback;
        channelState->callbackParam = config->chanConfigArray[index].callbackParam;
        channelState->enableNotification = false;
        /* Enable LPTMR interrupt */
        INT_SYS_EnableIRQ(lptmrIrq[instance][chanIndex]);
    }

    return status;
}
#endif

#if (defined(TIMING_OVER_FTM))
/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_InitFtm
 * Description   : This function initializes TIMING over FTM.
 *END**************************************************************************/
static status_t TIMING_InitFtm(uint32_t instance,
                               const timer_config_t * config)
{
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);

    status_t status = STATUS_SUCCESS;
    const IRQn_Type ftmIrq[FTM_INSTANCE_COUNT][FTM_CONTROLS_COUNT] = FTM_IRQS;
    static ftm_state_t ftmState;
    ftm_user_config_t ftmConfig;
    ftm_output_cmp_param_t outputCmpConfig;
    ftm_output_cmp_ch_param_t chnConfigArray[FTM_CONTROLS_COUNT];
    timer_chan_state_t * channelState;
    uint8_t chanIndex;
    uint8_t index;

    /* Set ftm structure */
    ftmConfig.syncMethod.softwareSync = true;
    ftmConfig.syncMethod.hardwareSync0 = false;
    ftmConfig.syncMethod.hardwareSync1 = false;
    ftmConfig.syncMethod.hardwareSync2 = false;
    ftmConfig.syncMethod.maxLoadingPoint = true;
    ftmConfig.syncMethod.minLoadingPoint = false;
    ftmConfig.syncMethod.inverterSync = FTM_SYSTEM_CLOCK;
    ftmConfig.syncMethod.outRegSync = FTM_SYSTEM_CLOCK;
    ftmConfig.syncMethod.maskRegSync = FTM_SYSTEM_CLOCK;
    ftmConfig.syncMethod.initCounterSync = FTM_SYSTEM_CLOCK;
    ftmConfig.syncMethod.autoClearTrigger = false;
    ftmConfig.syncMethod.syncPoint = FTM_UPDATE_NOW;
    ftmConfig.ftmMode = FTM_MODE_OUTPUT_COMPARE;
    ftmConfig.ftmPrescaler = ((extension_ftm_for_timer_t*)(config->extension))->prescaler;
    ftmConfig.ftmClockSource = ((extension_ftm_for_timer_t*)(config->extension))->clockSelect;
    ftmConfig.BDMMode = FTM_BDM_MODE_00;
    ftmConfig.isTofIsrEnabled = false;
    ftmConfig.enableInitializationTrigger = false;

    /* Initialize running status of FTM channels */
    for (index = 0U; index < FTM_CONTROLS_COUNT; index++)
    {
        g_ftmChannelRunning[instance][index] = false;
    }
    /* Set output compare configuration structure */
    for (index = 0U; index < config->numChan; index++)
    {
        chnConfigArray[index].hwChannelId = config->chanConfigArray[index].channel;
        chnConfigArray[index].chMode = FTM_TOGGLE_ON_MATCH;
        chnConfigArray[index].comparedValue = FTM_COMPARE_MAX;
        chnConfigArray[index].enableExternalTrigger = false;
    }
    outputCmpConfig.nNumOutputChannels = config->numChan;
    outputCmpConfig.mode = FTM_MODE_OUTPUT_COMPARE;
    outputCmpConfig.maxCountValue = ((extension_ftm_for_timer_t*)(config->extension))->finalValue;
    outputCmpConfig.outputChannelConfig = chnConfigArray;

    /* Initialize FTM instance */
    status = FTM_DRV_Init(instance, &ftmConfig, &ftmState);
    status |= FTM_DRV_InitOutputCompare(instance, &outputCmpConfig);

    if (status == STATUS_SUCCESS)
    {
        for (index = 0U; index < config->numChan; index++)
        {
            chanIndex = config->chanConfigArray[index].channel;
            channelState = &s_ftmState[instance][chanIndex];
            /* Save runtime state structure of timer channel */
            channelState->chanType = config->chanConfigArray[index].chanType;
            channelState->callback = config->chanConfigArray[index].callback;
            channelState->callbackParam = config->chanConfigArray[index].callbackParam;
            channelState->enableNotification = false;
            /* Install FTM irq handler */
            INT_SYS_InstallHandler(ftmIrq[instance][chanIndex],
                                   s_timingOverFtmIsr[instance][chanIndex], (isr_t*)0);
            /* Enable FTM interrupt */
            INT_SYS_EnableIRQ(ftmIrq[instance][chanIndex]);
        }
    }
    else
    {
        status = STATUS_ERROR;
    }

