kuangyue111/kuangyue111/软件例程/S32K144_SDK_RTM_2_0_Iar_Gcc_CombinePrj/S32K144_SDK_RTM_2_0_Iar_Gcc_CombinePrj/SDK/platform/pal/timing/src/timing_pal.c
    return status;
}
#endif

#if (defined(TIMING_OVER_PIT))
/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_InitPit
 * Description   : This function initializes TIMING over PIT.
 *END**************************************************************************/
static status_t TIMING_InitPit(uint32_t instance,
                               const timer_config_t * config)
{
    DEV_ASSERT(instance < PIT_INSTANCE_COUNT);

    status_t status = STATUS_SUCCESS;
    const IRQn_Type pitIrq[PIT_INSTANCE_COUNT][PIT_IRQS_CH_COUNT] = PIT_IRQS;
    pit_config_t pitConfig;
    pit_channel_config_t channelConfig;
    timer_chan_state_t * channelState;
    uint8_t chanIndex;
    uint8_t index;

    /* Set global structure */
#if FEATURE_PIT_HAS_RTI_CHANNEL
    pitConfig.enableRTITimer = false;
#endif
    pitConfig.enableStandardTimers = true;
    pitConfig.stopRunInDebug = true;
    /* Set channel configuration structure */
    channelConfig.hwChannel = 0U;
    channelConfig.periodUnit = PIT_PERIOD_UNITS_COUNTS;
    channelConfig.period = 0U;
    channelConfig.enableChain = false;
    channelConfig.enableInterrupt = true;

    /* Initialize PIT instance */
    PIT_DRV_Init(instance, &pitConfig);

    for (index = 0U; index < config->numChan; index++)
    {
        chanIndex = config->chanConfigArray[index].channel;
        channelState = &s_pitState[instance][chanIndex];
        /* Initialize PIT channels */
        channelConfig.hwChannel = chanIndex;
        status = PIT_DRV_InitChannel(instance, &channelConfig);
        if (status != STATUS_SUCCESS)
        {
            break;
        }
        /* Save runtime state structure of timer channel */
        channelState->chanType = config->chanConfigArray[index].chanType;
        channelState->callback = config->chanConfigArray[index].callback;
        channelState->callbackParam = config->chanConfigArray[index].callbackParam;
        channelState->enableNotification = false;
        /* Enable PIT interrupt */
        INT_SYS_EnableIRQ(pitIrq[instance][chanIndex]);
    }

    return status;
}
#endif

#if (defined(TIMING_OVER_STM))
/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_InitStm
 * Description   : This function initializes TIMING over STM.
 *END**************************************************************************/
static status_t TIMING_InitStm(uint32_t instance,
                               const timer_config_t * config)
{
    DEV_ASSERT(instance < STM_INSTANCE_COUNT);

    status_t status = STATUS_SUCCESS;
    const IRQn_Type stmIrq[STM_INSTANCE_COUNT][STM_CHANNEL_COUNT] = STM_IRQS;
    stm_config_t stmConfig;
    timer_chan_state_t * channelState;
    uint8_t chanIndex;
    uint8_t index;

    /* Set stm structure */
#if FEATURE_STM_HAS_CLOCK_SELECTION
    stmConfig.clockSource = ((extension_stm_for_timer_t*)(config->extension))->clockSelect;
    /* Save LPTMR clock source name */
    s_stmClockSource[instance] = ((extension_stm_for_timer_t*)(config->extension))->clockSelect;
#endif
    stmConfig.clockPrescaler = ((extension_stm_for_timer_t*)(config->extension))->prescaler;
    stmConfig.stopInDebugMode = true;
    stmConfig.startValue = 0U;
    /* Save LPTMR prescaler */
    s_stmPrescaler[instance] = ((extension_stm_for_timer_t*)(config->extension))->prescaler;
    /* Initialize STM instance */
    STM_DRV_Init(instance, &stmConfig);

    for (index = 0U; index < config->numChan; index++)
    {
        chanIndex = config->chanConfigArray[index].channel;
        channelState = &s_stmState[instance][chanIndex];
        /* Save runtime state structure of timer channel */
        channelState->chanType = config->chanConfigArray[index].chanType;
        channelState->callback = config->chanConfigArray[index].callback;
        channelState->callbackParam = config->chanConfigArray[index].callbackParam;
        channelState->enableNotification = false;
        /* Enable STM interrupt */
        INT_SYS_EnableIRQ(stmIrq[instance][chanIndex]);
    }

    return status;
}
#endif

/*******************************************************************************
 * FUCNTION FUNCTION
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_Init
 * Description   : Initialize timer instance.
 * This function initializes clock source, prescaler of the timer instance(except LPIT, PIT), the final
 * value of counter (only FTM). This function also setups notification type and callback function of timer channel.
 * The timer instance number and its configuration structure shall be passed as arguments.
 * Timer channels do not start counting by default after calling this function.
 * The function TIMING_StartChannel must be called to start the timer channel counting.
 *
 * Implements    : TIMING_Init_Activity
 *END**************************************************************************/
status_t TIMING_Init(const timing_instance_t * const instance,
                     const timer_config_t * const config)
{
    DEV_ASSERT(instance != NULL);
    DEV_ASSERT(config != NULL);
    status_t status = STATUS_ERROR;

    /* Define TIMING PAL over LPIT */
#if (defined (TIMING_OVER_LPIT))
    if (instance->instType == TIMING_INST_TYPE_LPIT)
    {
        /* Initialize TIMING over LPIT */
        status = TIMING_InitLpit(instance->instIdx, config);
    }
    else
#endif

    /* Define TIMING PAL over LPTMR */
#if (defined (TIMING_OVER_LPTMR))
    if (instance->instType == TIMING_INST_TYPE_LPTMR)
    {
        DEV_ASSERT(config->extension != NULL);

        /* Initialize TIMING over LPTMR */
        status = TIMING_InitLptmr(instance->instIdx, config);
    }
    else
#endif

    /* Define TIMING PAL over FTM */
#if (defined (TIMING_OVER_FTM))
    if (instance->instType == TIMING_INST_TYPE_FTM)
    {
        DEV_ASSERT(config->extension != NULL);

        /* Initialize TIMING over FTM */
        status = TIMING_InitFtm(instance->instIdx, config);
    }
    else
#endif

    /* Define TIMING PAL over PIT */
#if (defined (TIMING_OVER_PIT))
    if (instance->instType == TIMING_INST_TYPE_PIT)
    {
        /* Initialize TIMING over LPIT */
        status = TIMING_InitPit(instance->instIdx, config);
    }
    else
#endif

    /* Define TIMING PAL over STM */
#if (defined (TIMING_OVER_STM))
    if (instance->instType == TIMING_INST_TYPE_STM)
    {
        DEV_ASSERT(config->extension != NULL);

        /* Initialize TIMING over STM */
        status = TIMING_InitStm(instance->instIdx, config);
    }
    else
#endif
    {
        DEV_ASSERT(false);
    }

