kuangyue111/kuangyue111/软件例程/S32K144_SDK_RTM_2_0_Iar_Gcc_CombinePrj/S32K144_SDK_RTM_2_0_Iar_Gcc_CombinePrj/SDK/platform/pal/timing/src/timing_pal.c
    return status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_Deinit
 * Description   : De-initialize timer instance.
 * This function de-initializes timer instance.
 * In order to use the timer instance again, TIMING_Init must be called.
 *
 * Implements    : TIMING_Deinit_Activity
 *END**************************************************************************/
void TIMING_Deinit(const timing_instance_t * const instance)
{
    DEV_ASSERT(instance != NULL);

    /* Define TIMING PAL over LPIT */
#if (defined (TIMING_OVER_LPIT))
    if (instance->instType == TIMING_INST_TYPE_LPIT)
    {
        LPIT_DRV_Deinit(instance->instIdx);
    }
    else
#endif

    /* Define TIMING PAL over LPTMR */
#if (defined (TIMING_OVER_LPTMR))
    if (instance->instType == TIMING_INST_TYPE_LPTMR)
    {
        LPTMR_DRV_Deinit(instance->instIdx);
    }
    else
#endif

    /* Define TIMING PAL over FTM */
#if (defined (TIMING_OVER_FTM))
    if (instance->instType == TIMING_INST_TYPE_FTM)
    {
        status_t retVal;

        retVal = FTM_DRV_Deinit(instance->instIdx);
        (void)retVal;
    }
    else
#endif

    /* Define TIMING PAL over PIT */
#if (defined (TIMING_OVER_PIT))
    if (instance->instType == TIMING_INST_TYPE_PIT)
    {
        PIT_DRV_Deinit(instance->instIdx);
    }
    else
#endif

    /* Define TIMING PAL over STM */
#if (defined (TIMING_OVER_STM))
    if (instance->instType == TIMING_INST_TYPE_STM)
    {
        STM_DRV_Deinit(instance->instIdx);
    }
    else
#endif
    {
        DEV_ASSERT(false);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_StartChannel
 * Description   : Starts the timer channel counting.
 * This function starts channel counting with a new period in ticks.
 * Note that:
 * - If the timer is PIT or LPIT, to abort the current timer channel period and start a timer channel period with a
 *   new value, the timer channel must be stopped and started again.
 * - If the timer is FTM, this function start channel by enable channel interrupt generation.
 * - LPTMR and FTM is 16 bit timer, so the input period must be smaller than 65535.
 * - LPTMR and FTM is 16 bit timer, so the input period must be smaller than 65535.
 *
 * Implements    : TIMING_StartChannel_Activity
 *END**************************************************************************/
void TIMING_StartChannel(const timing_instance_t * const instance,
                         const uint8_t channel,
                         const uint32_t periodTicks)
{
    DEV_ASSERT(instance != NULL);

    timer_chan_state_t * channelState;

    /* Define TIMING PAL over LPIT */
#if (defined (TIMING_OVER_LPIT))
    if (instance->instType == TIMING_INST_TYPE_LPIT)
    {
        uint32_t channelMask = 1UL << channel;

        /* Set the channel compare value */
        LPIT_DRV_SetTimerPeriodByCount(instance->instIdx, channel, periodTicks);
        /* Start the channel counting */
        LPIT_DRV_StartTimerChannels(instance->instIdx, channelMask);

        channelState = &s_lpitState[instance->instIdx][channel];
        /* Save the period of channel */
        channelState->period = periodTicks;
        /* Enable notification */
        channelState->enableNotification = true;
    }
    else
#endif

    /* Define TIMING PAL over LPTMR */
#if (defined (TIMING_OVER_LPTMR))
    if (instance->instType == TIMING_INST_TYPE_LPTMR)
    {
        DEV_ASSERT(periodTicks <= LPTMR_COMPARE_MAX);
        DEV_ASSERT(channel < LPTMR_TMR_COUNT);
        uint32_t lptmrInstance = instance->instIdx;
        status_t retVal;

        /* Stop the channel counting */
        LPTMR_DRV_StopCounter(lptmrInstance);
        /* Set the channel compare value */
        retVal = LPTMR_DRV_SetCompareValueByCount(lptmrInstance, (uint16_t)periodTicks);
        (void)retVal;
        /* Start the channel counting */
        LPTMR_DRV_StartCounter(lptmrInstance);

        channelState = &s_lptmrState[lptmrInstance][channel];
        /* Save the period of channel */
        channelState->period = periodTicks;
        /* Enable notification */
        channelState->enableNotification = true;
    }
    else
#endif

    /* Define TIMING PAL over FTM */
#if (defined (TIMING_OVER_FTM))
    if (instance->instType == TIMING_INST_TYPE_FTM)
    {
        uint32_t ftmInstance = instance->instIdx;
        FTM_Type * const base = ftmBase[ftmInstance];
        uint32_t currentCounter;
        status_t retVal;

        DEV_ASSERT(periodTicks <= FTM_DRV_GetMod(base));

        /* Clear the channel interrupt flag which may be set after executed initialization timing function or a previous channel match event */
        FTM_DRV_ClearChnEventStatus(base, channel);
        /* Get current counter*/
        currentCounter = FTM_DRV_GetCounter(base);
        /* Update compare value of the channel */
        retVal = FTM_DRV_UpdateOutputCompareChannel(ftmInstance, channel, (uint16_t)periodTicks, FTM_RELATIVE_VALUE, false);
        /* Enable the channel by enable interrupt generation */
        retVal = FTM_DRV_EnableInterrupts(ftmInstance, (1UL << channel));
        /* Update channel running status */
        g_ftmChannelRunning[ftmInstance][channel] = true;
        (void)retVal;
        /* Save the start value of channel at the moment the start channel function is called */
        channelState = &s_ftmState[ftmInstance][channel];
        channelState->chanStartVal = currentCounter;
        /* Save the period of channel */
        channelState->period = periodTicks;
        /* Enable notification */
        channelState->enableNotification = true;
    }
    else
#endif

    /* Define TIMING PAL over PIT */
#if (defined (TIMING_OVER_PIT))
    if (instance->instType == TIMING_INST_TYPE_PIT)
    {
        const uint32_t pitInstance = instance->instIdx;
        /* Set the channel compare value */
        PIT_DRV_SetTimerPeriodByCount(pitInstance, channel, periodTicks);
        /* Start the channel counting */
        PIT_DRV_StartChannel(pitInstance, channel);

