kuangyue111/kuangyue111/软件例程/S32K144_SDK_RTM_2_0_Iar_Gcc_CombinePrj/S32K144_SDK_RTM_2_0_Iar_Gcc_CombinePrj/SDK/platform/pal/timing/src/timing_pal.c
        channelState = &s_pitState[pitInstance][channel];
        /* Save the period of channel */
        channelState->period = periodTicks;
        /* Enable notification */
        channelState->enableNotification = true;
    }
    else
#endif

    /* Define TIMING PAL over STM */
#if (defined (TIMING_OVER_STM))
    if (instance->instType == TIMING_INST_TYPE_STM)
    {
        uint32_t stmInstance = instance->instIdx;
        uint32_t currentCounter;
        uint32_t compareValue;

        /* Get current counter value */
        currentCounter = STM_DRV_GetCounterValue(stmInstance);
        /* Calculate the channel compare value */
        if ((STM_COMPARE_MAX - currentCounter) >= periodTicks)
        {
            /* The distance from current value to max of compare register is enough */
            compareValue = currentCounter + periodTicks;
        }
        else
        {
            /* The distance is not enough, calculates a new value for compare register */
            compareValue = periodTicks - (STM_COMPARE_MAX - currentCounter);
        }
        /* Configure channel compare value */
        STM_DRV_ConfigChannel(stmInstance, channel, compareValue);
        /* Start counter */
        STM_DRV_StartTimer(stmInstance);
        /* Save the start value of channel at the moment the start channel function is called */
        channelState = &s_stmState[stmInstance][channel];
        channelState->chanStartVal = currentCounter;
        /* Save the period of channel */
        channelState->period = periodTicks;
        /* Enable notification */
        channelState->enableNotification = true;
    }
    else
#endif
    {
        DEV_ASSERT(false);
    }

}

/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_StopChannel
 * Description   : Stop the timer channel counting.
 * This function stop channel counting. Note that if the timer is FTM,
 * this function stop channel by disable channel interrupt generation.
 *
 * Implements    : TIMING_StopChannel_Activity
 *END**************************************************************************/
void TIMING_StopChannel(const timing_instance_t * const instance,
                        const uint8_t channel)
{
    DEV_ASSERT(instance != NULL);

    timer_chan_state_t * channelState;

    /* Define TIMING PAL over LPIT */
#if (defined (TIMING_OVER_LPIT))
    if (instance->instType == TIMING_INST_TYPE_LPIT)
    {
        /* Stop the channel counting */
        LPIT_DRV_StopTimerChannels(instance->instIdx, (1UL << channel));

        channelState = &s_lpitState[instance->instIdx][channel];
        /* Disable notification */
        channelState->enableNotification = false;
    }
    else
#endif

    /* Define TIMING PAL over LPTMR */
#if (defined (TIMING_OVER_LPTMR))
    if (instance->instType == TIMING_INST_TYPE_LPTMR)
    {
        (void)channel;

        /* Stop the channel counting */
        LPTMR_DRV_StopCounter(instance->instIdx);

        channelState = &s_lptmrState[instance->instIdx][channel];
        /* Disable notification */
        channelState->enableNotification = false;
    }
    else
#endif

    /* Define TIMING PAL over FTM */
#if (defined (TIMING_OVER_FTM))
    if (instance->instType == TIMING_INST_TYPE_FTM)
    {
        /* Stop the channel by disable interrupt generation */
        FTM_DRV_DisableInterrupts(instance->instIdx, (1UL << channel));
        /* Update channel running status */
        g_ftmChannelRunning[instance->instIdx][channel] = false;
        channelState = &s_ftmState[instance->instIdx][channel];
        /* Disable notification */
        channelState->enableNotification = false;
    }
    else
#endif

    /* Define TIMING PAL over PIT */
#if (defined (TIMING_OVER_PIT))
    if (instance->instType == TIMING_INST_TYPE_PIT)
    {
        /* Stop the channel counting */
        PIT_DRV_StopChannel(instance->instIdx, channel);

        channelState = &s_pitState[instance->instIdx][channel];
        /* Disable notification */
        channelState->enableNotification = false;
    }
    else
#endif

    /* Define TIMING PAL over STM */
#if (defined (TIMING_OVER_STM))
    if (instance->instType == TIMING_INST_TYPE_STM)
    {
        /* Stop the channel counting */
        STM_DRV_DisableChannel(instance->instIdx, channel);

         /* Save the start value of channel at the moment the start channel function is called */
        channelState = &s_stmState[instance->instIdx][channel];
        /* Enable notification */
        channelState->enableNotification = false;
    }
    else
#endif
    {
        DEV_ASSERT(false);
    }

}

/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_GetElapsed
 * Description   : Get elapsed ticks.
 * This function gets elapsed time since the last event by ticks. The elapsed time by nanosecond, microsecond or
 * millisecond is the result of this function multiplies by the result of the TIMING_GetResolution
 * function.
 *
 * Implements    : TIMING_GetElapsed_Activity
 *END**************************************************************************/
uint32_t TIMING_GetElapsed(const timing_instance_t * const instance,
                           const uint8_t channel)
{
    DEV_ASSERT(instance != NULL);

    uint32_t currentCounter = 0U;
    uint32_t timeElapsed = 0U;

    /* Define TIMING PAL over LPIT */
#if (defined (TIMING_OVER_LPIT))
    if (instance->instType == TIMING_INST_TYPE_LPIT)
    {
        const timer_chan_state_t * lpitChannelState;
        /* Get current channel counter value */
        currentCounter = LPIT_DRV_GetCurrentTimerCount(instance->instIdx, channel);

        lpitChannelState = &s_lpitState[instance->instIdx][channel];
        /* Calculate timer elapsed */
        timeElapsed = lpitChannelState->period - currentCounter;
    }
    else
#endif

    /* Define TIMING PAL over LPTMR */
#if (defined (TIMING_OVER_LPTMR))
    if (instance->instType == TIMING_INST_TYPE_LPTMR)
    {
        (void)channel;
        (void)currentCounter;

        /* Time elapsed is current counter value */
        timeElapsed = LPTMR_DRV_GetCounterValueByCount(instance->instIdx);
    }
    else
#endif

    /* Define TIMING PAL over FTM */
#if (defined (TIMING_OVER_FTM))
    if (instance->instType == TIMING_INST_TYPE_FTM)
    {
        DEV_ASSERT((instance->instIdx) < FTM_INSTANCE_COUNT);

        uint32_t ftmInstance = instance->instIdx;
        const FTM_Type * const base = ftmBase[ftmInstance];
        uint16_t finalValue;
        const timer_chan_state_t * ftmChannelState;

        /* Get current FTM counter value */
        currentCounter = FTM_DRV_GetCounter(base);
        /* Get the final value of counter */
        finalValue = FTM_DRV_GetMod(base);
        ftmChannelState = &s_ftmState[ftmInstance][channel];
        /* Calculate time elapsed */
        if (currentCounter >= ftmChannelState->chanStartVal)
        {
            /* In case the counter is smaller than the final value of counter */
            timeElapsed = currentCounter - ftmChannelState->chanStartVal;
        }
        else
        {
            /* In case the counter is over the final value of counter */
            timeElapsed = (finalValue - ftmChannelState->chanStartVal) + currentCounter;
        }
    }
    else
#endif

    /* Define TIMING PAL over PIT */
#if (defined (TIMING_OVER_PIT))
    if (instance->instType == TIMING_INST_TYPE_PIT)
    {
        uint32_t pitInstance = instance->instIdx;
        const timer_chan_state_t * pitChannelState;

        /* Get current channel counter value */
        currentCounter = PIT_DRV_GetCurrentTimerCount(pitInstance, channel);

        pitChannelState = &s_pitState[pitInstance][channel];
        /* Calculate time elapsed */
        timeElapsed = pitChannelState->period - currentCounter;
    }
    else
#endif

    /* Define TIMING PAL over STM */
#if (defined (TIMING_OVER_STM))
    if (instance->instType == TIMING_INST_TYPE_STM)
    {
        uint32_t stmInstance = instance->instIdx;
        const timer_chan_state_t * stmChannelState;

        /* Get current counter value */
        currentCounter = STM_DRV_GetCounterValue(stmInstance);
        stmChannelState = &s_stmState[stmInstance][channel];
        /* Calculate time elapsed */
        if (currentCounter >= (stmChannelState->chanStartVal))
        {
            /* In case the counter is smaller than the final value of counter */
            timeElapsed = currentCounter - stmChannelState->chanStartVal;
        }
        else
        {
            /* In case the counter is over the final value of counter */
            timeElapsed = (STM_COMPARE_MAX - stmChannelState->chanStartVal) + currentCounter;
        }
    }
    else
#endif
    {
        DEV_ASSERT(false);
    }

    return timeElapsed;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_GetRemaining
 * Description   : Get remaining ticks.
 * This function gets remaining time to next event by ticks. The remaining time by nanosecond, microsecond or
 * millisecond is the result of this function multiplies by the result of the TIMING_GetResolution
 * function.
 *
 * Implements    : TIMING_GetRemaining_Activity
 *END**************************************************************************/
uint32_t TIMING_GetRemaining(const timing_instance_t * const instance,
                             const uint8_t channel)
{
    DEV_ASSERT(instance != NULL);

    uint32_t timeElapsed = 0U;
    uint32_t timeRemain = 0U;

    /* Define TIMING PAL over LPIT */
#if (defined (TIMING_OVER_LPIT))
    if (instance->instType == TIMING_INST_TYPE_LPIT)
    {
        (void)timeElapsed;
        /* Get the remaining time */
        timeRemain = LPIT_DRV_GetCurrentTimerCount(instance->instIdx, channel);
    }
    else
#endif

