kuangyue111/kuangyue111/软件例程/S32K144_SDK_RTM_2_0_Iar_Gcc_CombinePrj/S32K144_SDK_RTM_2_0_Iar_Gcc_CombinePrj/SDK/platform/pal/timing/src/timing_pal.c
    /* Define TIMING PAL over LPTMR */
#if (defined (TIMING_OVER_LPTMR))
    if (instance->instType == TIMING_INST_TYPE_LPTMR)
    {
        DEV_ASSERT(channel < LPTMR_TMR_COUNT);
        uint32_t lptmrInstance = instance->instIdx;
        const timer_chan_state_t * lptmrChannelState;

        /* Time elapsed is current counter value */
        timeElapsed = LPTMR_DRV_GetCounterValueByCount(lptmrInstance);

        lptmrChannelState = &s_lptmrState[lptmrInstance][channel];
        /* Calculate the remaining time */
        timeRemain = lptmrChannelState->period - timeElapsed;
    }
    else
#endif

    /* Define TIMING PAL over FTM */
#if (defined (TIMING_OVER_FTM))
    if (instance->instType == TIMING_INST_TYPE_FTM)
    {
        DEV_ASSERT((instance->instIdx) < FTM_INSTANCE_COUNT);

        uint32_t ftmInstance = instance->instIdx;
        const FTM_Type * const base = ftmBase[ftmInstance];
        uint16_t ftmCurrentCounter = 0U;
        uint16_t finalValue;
        const timer_chan_state_t * ftmChannelState;

        /* Get current FTM counter value */
        ftmCurrentCounter = FTM_DRV_GetCounter(base);
        /* Get the final value of counter */
        finalValue = FTM_DRV_GetMod(base);
        ftmChannelState = &s_ftmState[ftmInstance][channel];
        /* Calculate time elapsed */
        if (ftmCurrentCounter >= ftmChannelState->chanStartVal)
        {
            /* In case the counter is smaller than the final value of counter */
            timeElapsed = ftmCurrentCounter - ftmChannelState->chanStartVal;
        }
        else
        {
            /* In case the counter is over the final value of counter */
            timeElapsed = (finalValue - ftmChannelState->chanStartVal) + ftmCurrentCounter;
        }
        /* Get the remaining time */
        timeRemain = ftmChannelState->period - timeElapsed;
    }
    else
#endif

    /* Define TIMING PAL over PIT */
#if (defined (TIMING_OVER_PIT))
    if (instance->instType == TIMING_INST_TYPE_PIT)
    {
        (void)timeElapsed;

        /* Get the remaining time */
        timeRemain = PIT_DRV_GetCurrentTimerCount(instance->instIdx, channel);
    }
    else
#endif

    /* Define TIMING PAL over STM */
#if (defined (TIMING_OVER_STM))
    if (instance->instType == TIMING_INST_TYPE_STM)
    {
        uint32_t stmInstance = instance->instIdx;
        const timer_chan_state_t * stmChannelState;

        /* Get current counter value */
        uint32_t stmCurrentCounter = STM_DRV_GetCounterValue(stmInstance);
        stmChannelState = &s_stmState[stmInstance][channel];
        /* Calculate time elapsed */
        if ((stmCurrentCounter >= stmChannelState->chanStartVal))
        {
            /* In case the counter is smaller than the final value of counter */
            timeElapsed = stmCurrentCounter - stmChannelState->chanStartVal;
        }
        else
        {
            /* In case the counter is over the final value of counter */
            timeElapsed = (STM_COMPARE_MAX - stmChannelState->chanStartVal) + stmCurrentCounter;
        }
        /* Get the remaining time */
        timeRemain = stmChannelState->period - timeElapsed;
    }
    else
#endif
    {
        DEV_ASSERT(false);
    }

    return timeRemain;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_EnableNotification
 * Description   : Enable channel notifications.
 * This function enables channel notification.
 *
 * Implements    : TIMING_EnableNotification_Activity
 *END**************************************************************************/
void TIMING_EnableNotification(const timing_instance_t * const instance,
                               const uint8_t channel)
{
    DEV_ASSERT(instance != NULL);

    timer_chan_state_t * channelState;

    /* Define TIMING PAL over LPIT */
#if (defined (TIMING_OVER_LPIT))
    if (instance->instType == TIMING_INST_TYPE_LPIT)
    {
        DEV_ASSERT((instance->instIdx) < LPIT_INSTANCE_COUNT);

        channelState = &s_lpitState[instance->instIdx][channel];
        /* Enable notification */
        channelState->enableNotification = true;
    }
    else
#endif

    /* Define TIMING PAL over LPTMR */
#if (defined (TIMING_OVER_LPTMR))
    if (instance->instType == TIMING_INST_TYPE_LPTMR)
    {
        DEV_ASSERT((instance->instIdx) < LPTMR_INSTANCE_COUNT);
        DEV_ASSERT(channel < LPTMR_TMR_COUNT);
        uint32_t lptmrInstance = instance->instIdx;

        channelState = &s_lptmrState[lptmrInstance][channel];
        /* Enable notification */
        channelState->enableNotification = true;

    }
    else
#endif

    /* Define TIMING PAL over FTM */
#if (defined (TIMING_OVER_FTM))
    if (instance->instType == TIMING_INST_TYPE_FTM)
    {
        DEV_ASSERT((instance->instIdx) < FTM_INSTANCE_COUNT);
        uint32_t ftmInstance = instance->instIdx;

        channelState = &s_ftmState[ftmInstance][channel];
        /* Enable notification */
        channelState->enableNotification = true;
    }
    else
#endif

    /* Define TIMING PAL over PIT */
#if (defined (TIMING_OVER_PIT))
    if (instance->instType == TIMING_INST_TYPE_PIT)
    {
        DEV_ASSERT((instance->instIdx) < PIT_INSTANCE_COUNT);
        uint32_t pitInstance = instance->instIdx;

        channelState = &s_pitState[pitInstance][channel];
        /* Enable notification */
        channelState->enableNotification = true;
    }
    else
#endif

    /* Define TIMING PAL over STM */
#if (defined (TIMING_OVER_STM))
    if (instance->instType == TIMING_INST_TYPE_STM)
    {
        DEV_ASSERT((instance->instIdx) < STM_INSTANCE_COUNT);
        uint32_t stmInstance = instance->instIdx;

        channelState = &s_stmState[stmInstance][channel];
        /* Enable notification */
        channelState->enableNotification = true;
    }
    else
#endif
    {
        DEV_ASSERT(false);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_DisableNotification
 * Description   : Disable channel notifications
 * This function disables channel notification.
 *
 * Implements    : TIMING_DisableNotification_Activity
 *END**************************************************************************/
void TIMING_DisableNotification(const timing_instance_t * const instance,
                                const uint8_t channel)
{
    DEV_ASSERT(instance != NULL);

