kuangyue111/kuangyue111/软件例程/S32K144_SDK_RTM_2_0_Iar_Gcc_CombinePrj/S32K144_SDK_RTM_2_0_Iar_Gcc_CombinePrj/SDK/platform/pal/timing/src/timing_pal.c
    timer_chan_state_t * channelState;

    /* Define TIMING PAL over LPIT */
#if (defined (TIMING_OVER_LPIT))
    if (instance->instType == TIMING_INST_TYPE_LPIT)
    {
        DEV_ASSERT((instance->instIdx) < LPIT_INSTANCE_COUNT);

        channelState = &s_lpitState[instance->instIdx][channel];
        /* Enable notification */
        channelState->enableNotification = false;
    }
    else
#endif

    /* Define TIMING PAL over LPTMR */
#if (defined (TIMING_OVER_LPTMR))
    if (instance->instType == TIMING_INST_TYPE_LPTMR)
    {
        DEV_ASSERT((instance->instIdx) < LPTMR_INSTANCE_COUNT);
        DEV_ASSERT(channel < LPTMR_TMR_COUNT);

        channelState = &s_lptmrState[instance->instIdx][channel];
        /* Enable notification */
        channelState->enableNotification = false;

    }
    else
#endif

    /* Define TIMING PAL over FTM */
#if (defined (TIMING_OVER_FTM))
    if (instance->instType == TIMING_INST_TYPE_FTM)
    {
        DEV_ASSERT((instance->instIdx) < FTM_INSTANCE_COUNT);

        channelState = &s_ftmState[instance->instIdx][channel];
        /* Enable notification */
        channelState->enableNotification = false;
    }
    else
#endif

    /* Define TIMING PAL over PIT */
#if (defined (TIMING_OVER_PIT))
    if (instance->instType == TIMING_INST_TYPE_PIT)
    {
        DEV_ASSERT((instance->instIdx) < PIT_INSTANCE_COUNT);

        channelState = &s_pitState[instance->instIdx][channel];
        /* Enable notification */
        channelState->enableNotification = false;
    }
    else
#endif

    /* Define TIMING PAL over STM */
#if (defined (TIMING_OVER_STM))
    if (instance->instType == TIMING_INST_TYPE_STM)
    {
        DEV_ASSERT((instance->instIdx) < STM_INSTANCE_COUNT);

        channelState = &s_stmState[instance->instIdx][channel];
        /* Enable notification */
        channelState->enableNotification = false;
    }
    else
#endif
    {
        DEV_ASSERT(false);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_GetResolution
 * Description   : Get tick resolution
 * This function gets tick resolution in engineering units (nanosecond, microsecond or millisecond).
 * The result of this function is used to calculate period, remaining time or elapsed time in engineering units.
 *
 * Implements    : TIMING_GetResolution_Activity
 *END**************************************************************************/
status_t TIMING_GetResolution(const timing_instance_t * const instance,
                              const timer_resolution_type_t type,
                              uint64_t * const resolution)
{
    DEV_ASSERT(instance != NULL);
    DEV_ASSERT(resolution != NULL);

    status_t status = STATUS_SUCCESS;
    static uint32_t clkFrequency = 0U;
    uint64_t prescaler = 1U;

    /* Define TIMING PAL over LPIT */
#if (defined (TIMING_OVER_LPIT))
    if (instance->instType == TIMING_INST_TYPE_LPIT)
    {
        static const clock_names_t lpitClockName[LPIT_INSTANCE_COUNT] = {LPIT0_CLK};
        status_t clkErr;

        DEV_ASSERT((instance->instIdx) < LPIT_INSTANCE_COUNT);
        /* Gets current functional clock frequency of LPIT instance */
        clkErr = CLOCK_SYS_GetFreq(lpitClockName[instance->instIdx], &clkFrequency);
        /* Checks the functional clock module is available */
        (void)clkErr;
        DEV_ASSERT(clkErr == STATUS_SUCCESS);
        DEV_ASSERT(clkFrequency > 0U);
    }
    else
#endif

    /* Define TIMING PAL over LPTMR */
#if (defined (TIMING_OVER_LPTMR))
    if (instance->instType == TIMING_INST_TYPE_LPTMR)
    {
        DEV_ASSERT((instance->instIdx) < LPTMR_INSTANCE_COUNT);

        status_t clkErr;
        uint32_t lptmrInstance = instance->instIdx;
        clock_names_t inputClockName = SIRCDIV2_CLK;

        switch(s_lptmrClockSource[lptmrInstance])
        {
        case LPTMR_CLOCKSOURCE_SIRCDIV2:
            inputClockName = SIRCDIV2_CLK;
            break;
        case LPTMR_CLOCKSOURCE_1KHZ_LPO:
            inputClockName = SIM_LPO_1K_CLK;
            break;
        case LPTMR_CLOCKSOURCE_RTC:
            inputClockName = SIM_RTCCLK_CLK;
            break;
        case LPTMR_CLOCKSOURCE_PCC:
            inputClockName = LPTMR0_CLK;
            break;
        default:
            /* Invalid clock source */
            DEV_ASSERT(false);
            break;
        }
        /* Gets current functional clock frequency of LPTMR instance */
        clkErr = CLOCK_SYS_GetFreq(inputClockName, &clkFrequency);
        /* Checks the functional clock module is available */
        (void)clkErr;
        DEV_ASSERT(clkErr == STATUS_SUCCESS);
        DEV_ASSERT(clkFrequency > 0U);

        if (!s_lptmrBypassPrescaler[lptmrInstance])
        {
            prescaler = prescaler << ((uint8_t)s_lptmrPrescaler[lptmrInstance] + 1U);
        }
    }
    else
#endif

    /* Define TIMING PAL over FTM */
#if (defined (TIMING_OVER_FTM))
    if (instance->instType == TIMING_INST_TYPE_FTM)
    {
        DEV_ASSERT((instance->instIdx) < FTM_INSTANCE_COUNT);

        uint32_t ftmInstance = instance->instIdx;

        /* Gets current functional clock frequency of FTM instance */
        clkFrequency = FTM_DRV_GetFrequency(ftmInstance);
        DEV_ASSERT(clkFrequency > 0U);
    }
    else
#endif

    /* Define TIMING PAL over PIT */
#if (defined (TIMING_OVER_PIT))
    if (instance->instType == TIMING_INST_TYPE_PIT)
    {
        DEV_ASSERT((instance->instIdx) < PIT_INSTANCE_COUNT);

        status_t clkErr;
        uint32_t pitInstance = instance->instIdx;
        /* Gets current functional clock frequency of PIT instance */
        clkErr = CLOCK_SYS_GetFreq(s_pitClockName[pitInstance], &clkFrequency);
        /* Checks the functional clock module is available */
        (void)clkErr;
        DEV_ASSERT(clkErr == STATUS_SUCCESS);
        DEV_ASSERT(clkFrequency > 0U);
    }
    else
#endif

    /* Define TIMING PAL over STM */
#if (defined (TIMING_OVER_STM))
    if (instance->instType == TIMING_INST_TYPE_STM)
    {
        DEV_ASSERT((instance->instIdx) < STM_INSTANCE_COUNT);

        uint32_t stmInstance = instance->instIdx;
        status_t clkErr;
        clock_names_t inputClockName = CLOCK_NAME_COUNT;

#if FEATURE_STM_HAS_CLOCK_SELECTION
        switch(s_stmClockSource[stmInstance])
        {
        case STM_CLOCK_SYSTEM:
            inputClockName = FS80_CLK;
            break;
        case STM_CLOCK_FXOSC:
            inputClockName = FXOSC_CLK;
            break;
        default:
            /* Invalid clock source */
            DEV_ASSERT(false);
            break;
        }
#else
        inputClockName = PBRIDGEx_CLK;
#endif
        /* Gets current functional clock frequency of STM instance */
        clkErr = CLOCK_SYS_GetFreq(inputClockName, &clkFrequency);
        /* Checks the functional clock module is available */
        (void)clkErr;
        DEV_ASSERT(clkErr == STATUS_SUCCESS);
        DEV_ASSERT(clkFrequency > 0U);
        prescaler = (uint64_t)s_stmPrescaler[stmInstance] + 1UL;
    }
    else
#endif
    {
        DEV_ASSERT(false);
    }

    if (type == TIMER_RESOLUTION_TYPE_NANOSECOND)
    {
        /* For better precision, add half of the frequency before the division */
        *resolution = ((1000000000U * prescaler) + ((uint64_t)clkFrequency >> 1U)) / clkFrequency;
    }
    else if (type == TIMER_RESOLUTION_TYPE_MICROSECOND)
    {
        /* For better precision, add half of the frequency before the division */
        *resolution = ((1000000U * prescaler) + ((uint64_t)clkFrequency >> 1U)) / clkFrequency;
    }
    else
    {
        /* For better precision, add half of the frequency before the division */
        *resolution = ((1000U * prescaler) + ((uint64_t)clkFrequency >> 1U)) / clkFrequency;
    }

    if(*resolution == 0U)
    {
        status = STATUS_ERROR;
    }

