kuangyue111/kuangyue111/软件例程/S32K144_SDK_RTM_2_0_Iar_Gcc_CombinePrj/S32K144_SDK_RTM_2_0_Iar_Gcc_CombinePrj/SDK/platform/pal/timing/src/timing_pal.c
    if(*maxPeriod == 0U)
    {
        status = STATUS_ERROR;
    }

    return status;
}

#if (defined (TIMING_OVER_LPIT))
/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_Lpit_IrqHandler
 * Description   : Interrupt handler for TIMING over LPIT.
 * This is not a public API as it is called by IRQ whenever an interrupt
 * occurs.
 *
 *END**************************************************************************/
void TIMING_Lpit_IrqHandler(uint32_t instance, uint8_t channel)
{
    const timer_chan_state_t * channelState = &s_lpitState[instance][channel];

    if ((channelState->callback != NULL) && (channelState->enableNotification))
    {
        /* Call to callback function */
        (channelState->callback)(channelState->callbackParam);

        if (channelState->chanType == TIMER_CHAN_TYPE_ONESHOT)
        {
            uint32_t channelMask = 1UL << channel;
            /* Stop the channel counting */
            LPIT_DRV_StopTimerChannels(instance, channelMask);
        }
    }
    LPIT_DRV_ClearInterruptFlagTimerChannels(instance, (1UL << channel));

}
#endif

/* Define TIMING PAL over LPTMR */
#if (defined (TIMING_OVER_LPTMR))
/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_Lptmr_IrqHandler
 * Description   : Interrupt handler for TIMING over LPTMR.
 * This is not a public API as it is called by IRQ whenever an interrupt
 * occurs.
 *
 *END**************************************************************************/
void TIMING_Lptmr_IrqHandler(uint32_t instance, uint8_t channel)
{
    const timer_chan_state_t * channelState = &s_lptmrState[instance][channel];

    if ((channelState->callback != NULL) && (channelState->enableNotification))
    {
        /* Call to callback function */
        (channelState->callback)(channelState->callbackParam);

        if (channelState->chanType == TIMER_CHAN_TYPE_ONESHOT)
        {
            /* Stop the channel counting */
            LPTMR_DRV_StopCounter(instance);
        }
    }
    LPTMR_DRV_ClearCompareFlag(instance);
}
#endif

/* Define TIMING PAL over FTM */
#if (defined (TIMING_OVER_FTM))
/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_Ftm_IrqHandler
 * Description   : Interrupt handler for TIMING over FTM.
 * This is not a public API as it is called by IRQ whenever an interrupt
 * occurs.
 *
 *END**************************************************************************/
void TIMING_Ftm_IrqHandler(uint32_t instance, uint8_t channel)
{
     FTM_Type * const base = ftmBase[instance];
    timer_chan_state_t * channelState = &s_ftmState[instance][channel];

    if ((channelState->callback != NULL) && (channelState->enableNotification))
    {
        /* Call to callback function */
        (channelState->callback)(channelState->callbackParam);
    }
    /* Check notification type */
    if (channelState->chanType == TIMER_CHAN_TYPE_ONESHOT)
    {
        /* Stop the channel by disable interrupt generation */
        FTM_DRV_DisableInterrupts(instance, (1UL << channel));
        /* Update channel running status */
        g_ftmChannelRunning[instance][channel] = false;
    }
    else
    {
        status_t status;
        uint32_t currentCmpValue = 0U;
        uint32_t currentPeriod = channelState->period;
        uint32_t nexCompareValue = 0U;
        uint32_t finalValue;

        /* Get the final value of counter */
        finalValue = FTM_DRV_GetMod(base);
        /* Get current compare value of the channel */
        currentCmpValue = FTM_DRV_GetChnCountVal(base, channel);
        /* Calculate the next compare value of the channel */
        if ((finalValue - currentCmpValue) > currentPeriod)
        {
            nexCompareValue = currentCmpValue + currentPeriod;
        }
        else
        {
            nexCompareValue = currentPeriod - (finalValue - currentCmpValue);
        }
        /* Update next compare value to the channel */
        status = FTM_DRV_UpdateOutputCompareChannel(instance, channel, (uint16_t)nexCompareValue, FTM_ABSOLUTE_VALUE, false);
        (void)status;
        /* Save the start value of channel at the moment new period is started */
        channelState->chanStartVal = currentCmpValue;
    }
    /* Clear interrupt flag */
    FTM_DRV_ClearChnEventStatus(base, channel);
}
#endif

/* Define TIMING PAL over PIT */
#if (defined (TIMING_OVER_PIT))
/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_Pit_IrqHandler
 * Description   : Interrupt handler for TIMING over PIT.
 * This is not a public API as it is called by IRQ whenever an interrupt
 * occurs.
 *
 *END**************************************************************************/
void TIMING_Pit_IrqHandler(uint32_t instance, uint8_t channel)
{
    const timer_chan_state_t * channelState = &s_pitState[instance][channel];

    if ((channelState->callback != NULL) && (channelState->enableNotification))
    {
        /* Call to callback function */
        (channelState->callback)(channelState->callbackParam);
        /* Check notification type */
        if (channelState->chanType == TIMER_CHAN_TYPE_ONESHOT)
        {
            /* Stop the channel counting */
            PIT_DRV_StopChannel(instance, channel);
        }
    }
    PIT_DRV_ClearStatusFlags(instance, channel);
}
#endif

/* Define TIMING PAL over STM */
#if (defined (TIMING_OVER_STM))
/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_Stm_IrqHandler
 * Description   : Interrupt handler for TIMING over STM.
 * This is not a public API as it is called by IRQ whenever an interrupt
 * occurs.
 *
 *END**************************************************************************/
void TIMING_Stm_IrqHandler(uint32_t instance, uint8_t channel)
{
    uint32_t currentCounter = 0U;
    timer_chan_state_t * channelState = &s_stmState[instance][channel];

    /* Get current counter value */
    currentCounter = STM_DRV_GetCounterValue(instance);

    if ((channelState->callback != NULL) && (channelState->enableNotification))
    {
        /* Call to callback function */
        (channelState->callback)(channelState->callbackParam);
        /* Save the start value of channel at the moment new period is started */
        channelState->chanStartVal = currentCounter;
    }
    /* Check notification type */
    if (channelState->chanType == TIMER_CHAN_TYPE_ONESHOT)
    {
        /* Stop the channel counting */
        STM_DRV_DisableChannel(instance, channel);
    }
    else
    {
        /* Update next compare value of the channel*/
        STM_DRV_IncrementTicks(instance, channel, channelState->period);
    }
    STM_DRV_ClearStatusFlags(instance, channel);
}
#endif
/*******************************************************************************
 * EOF
 ******************************************************************************/
